OpenFOAM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          0.2;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii; //binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
	forceCoef				//	
	{
	    	type            forceCoeffs;
	    	libs            ("libforces.so");
	    	writeControl    timeStep;
	    	writeInterval   1;
		    log             yes;
		    rho             rhoInf;      
    		rhoInf          1;          
	    	patches         (cilindro);
	    	liftDir         (0 1 0);
	    	dragDir         (1 0 0);
	    	CofR            (0 0 0);       
	    	pitchAxis       (0 0 1);
	    	magUInf         1;
	    	lRef            1;      //comp de referencia para calculo do Cm
	    	Aref            2;	//area projetada do cilindro  = D*Z            
	}
    //#includeFunc residuals(p_rgh)
    //#includeFunc streamlinesLine(funcName=streamlines, start=(0 0.5 0), end=(9 0.5 0), nPoints=24, U)
}


// ************************************************************************* //
