OpenFOAM/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst; //eConst;
    equationOfState rhoConst; //Boussinesq;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       29; 		// Equiv. ao ar
    }
    equationOfState 
    {
        //rho0            1;			// Revisar equação de estado
        //T0              300;
        //beta            1e-03;
		rho				1.29;	//Massa específica para o ar
    }
    thermodynamics
    {
		// MOdelo termodinâmico à Cp constante 
		// h = Cp * (T - Tref) + href

		Cp				1005;		// Valor para o Ar
        Hf              0;			// "Entalpia de fundo"
    }
    transport
    {
        mu              0.86;				// Para N° de Reynolds = 3
        Pr              0.7;
    }
}


// ************************************************************************* //
