OpenFOAM/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    entrada
    {
        type            fixedFluxPressure;
    }
    saida
    {
        type            fixedValue;
        value           uniform 0;
    }
    cilindro
    {
        type            zeroGradient;
    }
    dominio
    {
        type            zeroGradient;
    }
    fundo
    {
        type            empty;
    }
    topo
    {
        type            empty;
    }
    bocal
    {
        type            zeroGradient;
    }
	

   // #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
